# notification-processor - production
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.aws_lambda_notification_v1_event.data.archive_file.default: Reading...
module.common_resources.module.aws_lambda_notification_v1_event_retry[0].data.archive_file.default: Reading...
module.common_resources.module.database_user.random_password.password: Refreshing state... [id=none]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_credential_id: Reading...
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.aws_lambda_notification_v1_event.data.aws_iam_policy_document.lambda_role_policy_document: Reading...
module.common_resources.module.aws_lambda_notification_v1_event_retry[0].aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/notification_processor_notification_v1_event_retry_0]
module.common_resources.module.aws_lambda_notification_v1_event.aws_cloudwatch_log_group.default: Refreshing state... [id=/aws/lambda/notification_processor_notification_v1_event]
module.common_resources.data.aws_ssm_parameter.kafka_cluster_id: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_topic_credential_secret_name: Reading...
module.common_resources.module.aws_lambda_notification_v1_event_retry[0].data.aws_iam_policy_document.lambda_role_policy_document: Reading...
module.common_resources.module.aws_lambda_notification_v1_event.data.aws_iam_policy_document.lambda_role_policy_document: Read complete after 0s [id=3693445097]
module.common_resources.module.aws_lambda_notification_v1_event.aws_iam_role.lambda_role: Refreshing state... [id=le-notification_processor_notification_v1_event]
module.common_resources.module.aws_lambda_notification_v1_event_retry[0].data.aws_iam_policy_document.lambda_role_policy_document: Read complete after 0s [id=3693445097]
module.common_resources.module.aws_lambda_notification_v1_event_retry[0].aws_iam_role.lambda_role: Refreshing state... [id=le-notification_processor_notification_v1_event_retry_0]
module.common_resources.data.aws_ssm_parameter.kafka_topic_credential_secret_name: Read complete after 0s [id=upstash_kafka_credential_secret_name]
module.common_resources.data.aws_secretsmanager_secret.kafka_topic_credential: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_cluster_id: Read complete after 0s [id=upstash_kafka_cluster_id]
module.common_resources.data.upstash_kafka_cluster_data.kafka_cluster: Reading...
module.common_resources.data.aws_ssm_parameter.kafka_cluster_credential_id: Read complete after 0s [id=upstash_kafka_cluster_credential_id]
module.common_resources.data.upstash_kafka_credential_data.default: Reading...
module.common_resources.module.database_user.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=cockroachdb_serverless_cluster_id]
module.common_resources.module.database_user.cockroach_sql_user.default: Refreshing state... [id=a27f5636-438f-4b19-b110-9d75fb1c2982:notification_processor]
module.common_resources.module.aws_lambda_notification_v1_event_retry[0].aws_iam_role_policy_attachment.default: Refreshing state... [id=le-notification_processor_notification_v1_event_retry_0-20230526004023517100000002]
module.common_resources.module.aws_lambda_notification_v1_event.aws_iam_role_policy_attachment.default: Refreshing state... [id=le-notification_processor_notification_v1_event-20230526004023404300000001]
module.common_resources.data.aws_secretsmanager_secret.kafka_topic_credential: Read complete after 1s [id=arn:aws:secretsmanager:us-east-1:064003852748:secret:upstash_kafka_credential_542599-Wf1ZwL]
module.common_resources.module.aws_lambda_notification_v1_event.data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Reading...
module.common_resources.module.aws_lambda_notification_v1_event_retry[0].data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Reading...
module.common_resources.module.aws_lambda_notification_v1_event.data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Read complete after 0s [id=1678494158]
module.common_resources.module.aws_lambda_notification_v1_event_retry[0].data.aws_iam_policy_document.lambda_secrets_policy_document[0]: Read complete after 0s [id=1678494158]
module.common_resources.module.aws_lambda_notification_v1_event_retry[0].aws_iam_role_policy.lambda_secrets_policy[0]: Refreshing state... [id=le-notification_processor_notification_v1_event_retry_0:lambda-secrets-policy-notification_processor_notification_v1_event_retry_0]
module.common_resources.module.aws_lambda_notification_v1_event.aws_iam_role_policy.lambda_secrets_policy[0]: Refreshing state... [id=le-notification_processor_notification_v1_event:lambda-secrets-policy-notification_processor_notification_v1_event]
module.common_resources.data.upstash_kafka_credential_data.default: Read complete after 1s [id=upstash-kafka-credential-f9f7c577-70dc-48cf-b92a-8e78f4e7ba53]
module.common_resources.data.upstash_kafka_cluster_data.kafka_cluster: Read complete after 1s [id=upstash-cluster-b8487336-854b-451c-8fc9-94888c7b9920]
module.common_resources.module.aws_lambda_notification_v1_event_retry[0].data.archive_file.default: Read complete after 1s [id=c3f04174b8c9a1a3b027732897bb367f1d42e3eb]
module.common_resources.module.aws_lambda_notification_v1_event_retry[0].aws_lambda_function.default: Refreshing state... [id=notification_processor_notification_v1_event_retry_0]
module.common_resources.module.aws_lambda_notification_v1_event.data.archive_file.default: Read complete after 1s [id=c3f04174b8c9a1a3b027732897bb367f1d42e3eb]
module.common_resources.module.aws_lambda_notification_v1_event.aws_lambda_function.default: Refreshing state... [id=notification_processor_notification_v1_event]
module.common_resources.aws_lambda_event_source_mapping.kafka_trigger_notification_v1_event_topic: Refreshing state... [id=128dee4a-f703-4d9c-aa58-00f0a0b9866c]
module.common_resources.aws_lambda_event_source_mapping.kafka_trigger_notification_v1_event_retry_topics[0]: Refreshing state... [id=1a6c19d2-5c8e-47e3-b40b-90e719734aa2]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.common_resources.module.aws_lambda_notification_v1_event.aws_lambda_function.default will be updated in-place
  ~ resource "aws_lambda_function" "default" {
        id                             = "notification_processor_notification_v1_event"
      ~ last_modified                  = "2023-05-26T05:50:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "ey5dk2GuSH9U9s4VxbO9Q0ahbkXzEyj0knaDyK1tm6s=" -> "66tjHcxVvkXL3J7bYxpT3jSqvpODXsJIpjb3XaDweLQ="
        tags                           = {
            "domain"        = "notification"
            "environment"   = "production"
            "resource"      = "notification-processor"
            "resource_type" = "lambda"
        }
        # (20 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONNECTILLY_KAFKA_KAFKAGO_BOOTSTRAP_SERVERS" = "growing-manatee-9600-us1-kafka.upstash.io:9092"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_SASL"       = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_TLS"        = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_PASSWORD"          = "0530d124acdb4f93827d8c855a8495d8"
              - "CONNECTILLY_KAFKA_KAFKAGO_SASL_ALGORITHM"    = "sha512"
              - "CONNECTILLY_KAFKA_KAFKAGO_USERNAME"          = "Z3Jvd2luZy1tYW5hdGVlLTk2MDAkV03Y9Mt_Nt3bGXzoyjKDvNOcBz3mi9198U0"
              - "CONNECTILLY_POSTGRES_CONNECTIONSTRING"       = (sensitive value)
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.common_resources.module.aws_lambda_notification_v1_event_retry[0].aws_lambda_function.default will be updated in-place
  ~ resource "aws_lambda_function" "default" {
        id                             = "notification_processor_notification_v1_event_retry_0"
      ~ last_modified                  = "2023-05-26T05:50:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "ey5dk2GuSH9U9s4VxbO9Q0ahbkXzEyj0knaDyK1tm6s=" -> "66tjHcxVvkXL3J7bYxpT3jSqvpODXsJIpjb3XaDweLQ="
        tags                           = {
            "domain"        = "notification"
            "environment"   = "production"
            "resource"      = "notification-processor"
            "resource_type" = "lambda"
        }
        # (20 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "CONNECTILLY_KAFKA_KAFKAGO_BOOTSTRAP_SERVERS" = "growing-manatee-9600-us1-kafka.upstash.io:9092"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_SASL"       = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_ENABLE_TLS"        = "true"
              - "CONNECTILLY_KAFKA_KAFKAGO_PASSWORD"          = "0530d124acdb4f93827d8c855a8495d8"
              - "CONNECTILLY_KAFKA_KAFKAGO_SASL_ALGORITHM"    = "sha512"
              - "CONNECTILLY_KAFKA_KAFKAGO_USERNAME"          = "Z3Jvd2luZy1tYW5hdGVlLTk2MDAkV03Y9Mt_Nt3bGXzoyjKDvNOcBz3mi9198U0"
              - "CONNECTILLY_POSTGRES_CONNECTIONSTRING"       = (sensitive value)
            } -> (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # module.common_resources.module.database_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "notification"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "notification_processor"
    }

  # module.common_resources.module.database_user.cockroach_sql_user.default will be updated in-place
  ~ resource "cockroach_sql_user" "default" {
        id         = "a27f5636-438f-4b19-b110-9d75fb1c2982:notification_processor"
        name       = "notification_processor"
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.common_resources.module.database_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "e0bd8fae-15e1-4af9-9265-5523786008d4" -> "5dbcbff7-7bd4-46dd-bb45-9a0f1074d86b"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

Plan: 1 to add, 3 to change, 1 to destroy.

Changes to Outputs:
  ~ database_user_connection_string = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*